/*
Задача 1: 
Напишите программу, которая запрашивает у пользователя его возраст с помощью prompt()
и выводит разное сообщение в зависимости от возраста:
Если возраст меньше 18, выведите "Доступ запрещен".
Если возраст от 18 до 65 включительно, выведите "Добро пожаловать!".
Если возраст больше 65, выведите "Пожалуйста, соблюдайте осторожность".
*/

let userAge = prompt('Введите ваш возраст');

if (userAge < 18) {
    console.log("Доступ запрещен");
} else if (userAge > 65) {
    console.log("Пожалуйста, соблюдайте осторожность");
} else {
    console.log("Добро пожаловать!");
}